app/Services/CustomerService.php

    public function getFormExportData($exportForm){
        $item = [];
        $customer = Customer::with(['invoices'=>function($query) use($exportForm){
            return $query->with('products')->whereBetween('invoices.create_date', [$exportForm['date_from'], $exportForm['date_to']]);
        }])
        ->where('id',$exportForm['id'])
        ->first()
        ->toArray();
---
select * from `customers` where `id` = '7' limit 1
select * from `invoices` where `invoices`.`customer_id` in (7) and `invoices`.`create_date` between '2020-11-14' and '2020-11-14'
select `products`.*, `invoice_product`.`invoice_id` as `pivot_invoice_id`, `invoice_product`.`product_id` as `pivot_product_id` from `products` inner join `invoice_product` on `products`.`id` = `invoice_product`.`product_id` where `invoice_product`.`invoice_id` in (18)

    public function searchCustomer($searchForm){
        $customers = Customer::where('customer_name','LIKE','%'.$searchForm['search_keyword'].'%')
        ->orWhere('mobile_phone','LIKE','%'.$searchForm['search_keyword'].'%')
        ->paginate(10);
---
select * from `customers` where `customer_name` LIKE '%%' or `mobile_phone` LIKE '%%' limit 10 offset 0
select count(*) as aggregate from `customers` where `customer_name` LIKE '%%' or `mobile_phone` LIKE '%%'