app/Repository/Customer/CustomerRepository.php

    public function update($id,$data){
        $productData = $this->customerService->getFormCustomerData($data);
        $now = Carbon::now()->format('Y-m-d');
        $this->customer->where('id',$data['id'])->update([
            'customer_name'=> $data['customer_name']
        ]);
        $invoiceCreateDate = Invoice::where('customer_id',$data['id'])->max('create_date');
        if(isset($invoiceCreateDate) && $now > $invoiceCreateDate){
            foreach($productData as $product){
                if(isset($product['product_id'])){
                    $id = $product['product_id'];
                    unset($product['product_id']);
                    $product = Product::where('id',$id)->update($product);
                }else{
                    $invoice = Invoice::updateOrCreate([
                        'customer_id' => $data['id'],
                        'create_date' => $now
                    ]);
                    $product = Product::create($product);
                    $invoice->products()->attach($product->id);
                }
            }
        }else{
            $invoice = Invoice::with('products')->where([['customer_id',$data['id']],['create_date',$now]])->first();
            if(isset($invoice)){
                foreach($productData as $product){
                    if(isset($product['product_id'])){
                        $id = $product['product_id'];
                        unset($product['product_id']);
                        $product = Product::where('id',$id)->update($product);
                    }else{
                        $product = Product::create($product);
                        $invoice->products()->attach($product->id);
---
update `customers` set `customer_name` = 'test', `customers`.`updated_at` = '2020-11-15 03:16:03' where `id` = '7'
select max(`create_date`) as aggregate from `invoices` where `customer_id` = '7'
update `products` set `product_name` = 'test', `product_unit` = 'cái', `product_amount` = '3', `product_price` = '1231233', `products`.`updated_at` = '2020-11-15 02:30:48' where `id` = '28'
insert into `invoice_product` (`invoice_id`, `product_id`) values (19, 29)
select * from `invoices` where (`customer_id` = '7' and `create_date` = '2020-11-15') limit 1
select `products`.*, `invoice_product`.`invoice_id` as `pivot_invoice_id`, `invoice_product`.`product_id` as `pivot_product_id` from `products` inner join `invoice_product` on `products`.`id` = `invoice_product`.`product_id` where `invoice_product`.`invoice_id` in (23)
update `products` set `product_name` = 'test', `product_unit` = 'cái', `product_amount` = '3', `product_price` = '1231233', `products`.`updated_at` = '2020-11-15 03:16:03' where `id` = '28'
insert into `invoice_product` (`invoice_id`, `product_id`) values (23, 36)

                ]);
                foreach($productData as $product){
                    $product = Product::create($product);
                    $invoice->products()->attach($product->id);
---
insert into `invoice_product` (`invoice_id`, `product_id`) values (17, 26)

    public function edit($id){
        return $this->customer->with(['invoices'=> function($query){
            return $query->with('products');
        }])
        ->find($id);
---
select * from `customers` where `customers`.`id` = '7' limit 1
select * from `invoices` where `invoices`.`customer_id` in (7)
select `products`.*, `invoice_product`.`invoice_id` as `pivot_invoice_id`, `invoice_product`.`product_id` as `pivot_product_id` from `products` inner join `invoice_product` on `products`.`id` = `invoice_product`.`product_id` where `invoice_product`.`invoice_id` in (18, 19)

    public function delete($id){
        $invoice = Invoice::with('products')->where('customer_id',$id)->first();
        if(isset($invoice->products)){
            $productId = tap($invoice->products)->toArray()->pluck('id');
            $invoice->products()->detach($productId);
            Product::whereIn('id',$productId)->delete();
            $invoice->delete();
        }
        $this->customer->destroy($id);
---
select * from `invoices` where `customer_id` = '4' limit 1
delete from `customers` where `id` = 1
delete from `customers` where `id` = 4