app/Http/Controllers/ProductController.php

    public function destroy(Request $request,Product $product)
    {
        //
        $productForm = $request->only('product_id');
        $product = Product::with('invoices')->where('id',$productForm['product_id'])->first();
        $product->invoices[0]->products()->detach($productForm['product_id']);
        $hasTask = $product->invoices[0]->products()->exists();
        if(!$hasTask){
            $product->invoices[0]->delete();
        }
        $product->delete();
---
select `invoices`.*, `invoice_product`.`product_id` as `pivot_product_id`, `invoice_product`.`invoice_id` as `pivot_invoice_id` from `invoices` inner join `invoice_product` on `invoices`.`id` = `invoice_product`.`invoice_id` where `invoice_product`.`product_id` in (42)
select `products`.*, `invoice_product`.`invoice_id` as `pivot_invoice_id`, `invoice_product`.`product_id` as `pivot_product_id` from `products` inner join `invoice_product` on `products`.`id` = `invoice_product`.`product_id` where `invoice_product`.`invoice_id` in (29)
delete from `invoices` where `id` = 29
delete from `products` where `id` = 42